from app.db_helper import DBHelper

db = DBHelper()

questions = [
    {"question": "1. ترجمه صحیح جمله‌ی (نَعَم . لَهُ  بِنتانِ و وَلَدُ صَغیرُ) در کدام گزینه می‌باشد؟",
     "options": [
         "بله. دختر و پسر بزرگ دارد",
         "بله. دو دختر و پسری کوچک دارد",
         "بله. دختران و پسران کوچکی دارم",
         "بله. دو دختر و یک پسر بزرگ دارد"
     ]},

    {"question": "2. معنی (اَنفَعُ) در کدام گزینه درست آمده است؟",
     "options": ["سودمند", "اطراف", "سودمندترین", "میز"]},

    {"question": "3. متضاد کلمه‌ی «ارزان» کدام است؟",
     "options": ["رخیصه", "یسار", "بیت", "غالیه"]},

    {"question": "4. ترجمه‌ی (الخیرُ کثیرٌ و فاعِلُهُ قَلیلٌ) در کدام گزینه آمده است؟",
     "options": [
         "خوبی کم و انجام دهنده‌اش کمتر است",
         "خوبی بسیار و انجام دهنده‌اش کم است",
         "خوبی بسیار و انجام دهنده‌اش زیادتر است",
         "چرا انجام دهنده‌ی خوبی زیاد است؟"
     ]},

    {"question": "5. آقای احمدی از شما می‌خواهد معنی علامت (الدوران الی الیمین ممنوع) را به او بگویید!",
     "options": ["به راست بپیچید", "به چپ بپیچید", "چرخش به چپ ممنوع", "چرخش به راست ممنوع"]},

    {"question": "6. (واحد . اثنان . ..... . ..... . خمسه) در جاهای خالی به ترتیب چه اعدادی قرار می‌گیرد؟",
     "options": ["ثلاثه . اربعه", "ثمانیه . تسعه", "ثلاثه . سبعه", "ثلاثه . تسعه"]},

    {"question": "7. (... سوره باسم الحیوانات فی القران؟ خمس سور) برای تکمیل کردن سوال بهتر است از کدام گزینه استفاده کنیم؟",
     "options": ["من این", "کم", "ماذا", "ما"]},

    {"question": "8. چه کلمه‌ای مخالف (بارد) می‌باشد؟",
     "options": ["ب", "بدا ب", "لان", "حار"]},

    {"question": "9. (انا = من / .... = مادرم - انتَ = .... / .... = مادرت «مذکر») در جاهای خالی به ترتیب چه کلماتی قرار می‌گیرد؟",
     "options": ["امی / تو مونث / امکَ", "امکَ / تو مذکر / امی", "امی / تو مذکر / امکَ", "امی / من / امکَ"]},

    {"question": "10. سَلِمَ = سالم ماند - هُنَّ ....... = آن‌ها سالم نماندند / جای خالی را پر کنید؟",
     "options": ["ما سَلِمنَّ", "ما سلمت", "سَلِمَت", "ما سَلِمَت"]}
]

correct_answers = {
    "q1": 2,   # بله. دو دختر و پسری کوچک دارد
    "q2": 3,   # سودمندترین
    "q3": 4,   # غالیه
    "q4": 2,   # خوبی بسیار و انجام دهنده‌اش کم است
    "q5": 4,   # چرخش به راست ممنوع
    "q6": 1,   # ثلاثه . اربعه
    "q7": 2,   # کم
    "q8": 4,   # حار
    "q9": 3,   # امی / تو مذکر / امکَ
    "q10": 1   # ما سَلِمنَّ
}
success = db.exam.add_exam(planet_id=4, questions=questions, correct_answers=correct_answers)

if success:
    print("✅")
else:
    print("")

success = db.exam.add_teach_note(planet_id=4, address='docs/arabi.pdf')

if success:
    print("✅✅")
else:
    print("❌❌")
